const About = () => {
    return (
        <div className=" w-full h-dvh">
            <div className="h-[20vh] mt-10 w-full flex justify-center items-center flex-col">
                <p className="font-[kmedium] text-black md:text-[28px]">แพลตฟอร์มของเราเป็น Notification Gateway ตัวกลาง</p>
                <p className="font-[kregular] text-[14px] md:text-[18px] text-gray-500 text-center w-[350px] md:w-full">ที่ช่วยให้คุณรับการแจ้งเตือนจากระบบภายนอกได้ โดยไม่จำเป็นต้องเปิด Webhook หรือเปิดพอร์ต</p>
            </div>
            <div className="w-full flex justify-center items-center">
                <hr className="w-[60%]" />
            </div>

            <div className="w-full flex justify-center items-center gap-20 flex-col md:flex-row">
                <img className="w-[200px] h-[450px] mt-10" src={'/me3.png'}></img>
                <div className="flex flex-col">
                    <p className="font-[kbold] text-center md:text-start">รัฐนนท์ บุญมาตา</p>
                    <p className="font-[kregular] text-gray-400 text-[14px]">Founder Whanjeabs Notifications</p>
                </div>
            </div>

            <div className="w-full flex justify-center h-[30vh] bg-gray-100 mt-30 items-center flex-col gap-5">
                <p className="font-[kmedium] text-center w-[300px] md:w-[700px] md:text-[24px] underline">เราออกแบบมาเพื่อแก้ปัญหาที่นักพัฒนาและทีมงานเจอบ่อย</p>
                <ul className="list-disc">
                    <li className="font-[kregular]">ไม่ต้องตั้งค่า Webhook ให้ซับซ้อน</li>
                    <li className="font-[kregular]">ไม่ต้องเปิด Public Endpoint</li>
                    <li className="font-[kregular]">ไม่ต้องกังวลเรื่อง Firewall, NAT หรือ Security</li>
                </ul>
            </div>

            <div className="w-full flex justify-center h-[50vh] items-center bg-gray-100/0 flex-col gap-5 p-10 md:p-0">
                <p className="font-[kmedium] text-[16px] md:text-[24px] underline ">ทำไมต้องใช้แพลตฟอร์มของเรา</p>
                <ul className="list-decimal">
                    <li className="font-[kregular]">ไม่ต้องเปิด Webhook รับ Notification ได้แม้ระบบคุณอยู่หลัง Firewall หรือ Local Network</li>
                    <li className="font-[kregular]">ปลอดภัยกว่า ลดความเสี่ยงจากการเปิด Endpoint ให้เข้าถึงโดยตรง</li>
                    <li className="font-[kregular]">ใช้งานง่าย แค่ยิง Request มาที่เรา ก็พร้อมใช้งานทันที</li>
                    <li className="font-[kregular]">เหมาะกับทุกขนาดระบบ ตั้งแต่โปรเจกต์เล็ก ไปจนถึงระบบ Production</li>
                    <li className="font-[kregular]">รองรับหลายรูปแบบ ใช้ได้กับระบบหลากหลาย ไม่ว่าจะเป็น Backend, Script, Bot หรือ Service อื่น ๆ</li>
                </ul>
            </div>

            <div className="w-full flex justify-center h-[50vh] items-center bg-gray-100 flex-col gap-5 p-5">
                <p className="font-[kmedium] md:text-[24px] underline">เหมาะกับใคร</p>
                <ul className="list">
                    <li className="font-[kregular]">- นักพัฒนา (Developer)</li>
                    <li className="font-[kregular]">- ปลอดภัยกว่า ลดความเสี่ยงจากการเปิด Endpoint ให้เข้าถึงโดยตรง</li>
                    <li className="font-[kregular]">- ทีม DevOps / Backend</li>
                    <li className="font-[kregular]">- ระบบที่ไม่สามารถเปิด Webhook ได้</li>
                    <li className="font-[kregular]">- ผู้ที่ต้องการ Notification แบบรวดเร็วและปลอดภัย</li>
                </ul>
            </div>

            {/* <p>เกี่ยวกับเรา (About)
                แพลตฟอร์มของเราเป็น Notification Gateway ตัวกลาง
                ที่ช่วยให้คุณรับการแจ้งเตือนจากระบบภายนอกได้ โดยไม่จำเป็นต้องเปิด Webhook หรือเปิดพอร์ตใด ๆ
                เราออกแบบมาเพื่อแก้ปัญหาที่นักพัฒนาและทีมงานมักเจอ เช่น
                ไม่ต้องตั้งค่า Webhook ให้ซับซ้อน
                ไม่ต้องเปิด Public Endpoint
                ไม่ต้องกังวลเรื่อง Firewall, NAT หรือ Security
                เพียงแค่ระบบภายนอก ส่ง (ยิง) ข้อมูลแจ้งเตือนมาที่เรา
                เราจะจัดการแปลง จัดคิว และกระจาย Notification ไปยังปลายทางที่คุณต้องการทันที
                ทำไมต้องใช้แพลตฟอร์มของเรา
                🚀 ไม่ต้องเปิด Webhook
                รับ Notification ได้แม้ระบบคุณอยู่หลัง Firewall หรือ Local Network
                🔒 ปลอดภัยกว่า
                ลดความเสี่ยงจากการเปิด Endpoint ให้เข้าถึงโดยตรง
                ⚡ ใช้งานง่าย
                แค่ยิง Request มาที่เรา ก็พร้อมใช้งานทันที
                🔄 รองรับหลายรูปแบบ
                ใช้ได้กับระบบหลากหลาย ไม่ว่าจะเป็น Backend, Script, Bot หรือ Service อื่น ๆ
                📦 เหมาะกับทุกขนาดระบบ
                ตั้งแต่โปรเจกต์เล็ก ไปจนถึงระบบ Production
                เหมาะกับใคร
                นักพัฒนา (Developer)
                ทีม DevOps / Backend
                ระบบที่ไม่สามารถเปิด Webhook ได้
                ผู้ที่ต้องการ Notification แบบรวดเร็วและปลอดภัย</p> */}
        </div>
    )
}

export default About